### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.s3.aws_s3_bucket.site will be created
+   resource "aws_s3_bucket" "site" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "ctrlplusaltplusdefeat-site"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "ManagedByTerraform" = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.site_policy will be created
+   resource "aws_s3_bucket_policy" "site_policy" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "s3:GetObject"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E237COLFHZV8AY"
                        }
+                       Resource  = "arn:aws:s3:::ctrlplusaltplusdefeat-site/*"
+                       Sid       = "PolicyForCloudFrontPrivateContent"
                    },
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           StringNotEquals = {
+                               "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = "arn:aws:s3:::ctrlplusaltplusdefeat-site/*"
+                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           Null = {
+                               "s3:x-amz-server-side-encryption" = "true"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = "arn:aws:s3:::ctrlplusaltplusdefeat-site/*"
+                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
+                   {
+                       Action    = "s3:*"
+                       Condition = {
+                           Bool = {
+                               "aws:SecureTransport" = "false"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = [
+                           "arn:aws:s3:::ctrlplusaltplusdefeat-site",
+                           "arn:aws:s3:::ctrlplusaltplusdefeat-site/*",
                        ]
+                       Sid       = "AllowSSLRequestsOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.s3.aws_s3_bucket_public_access_block.site_public_access_block will be created
+   resource "aws_s3_bucket_public_access_block" "site_public_access_block" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.site_encryption will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "site_encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.site_versioning will be created
+   resource "aws_s3_bucket_versioning" "site_versioning" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>